Revit 2024 API
ComboBox.DropDownClosed Event
Subscribe to this event to be notified when the drop-down of the ComboBox is closed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public event EventHandler<ComboBoxDropDownClosedEventArgs> DropDownClosed
Visual Basic
Public Event DropDownClosed As EventHandler(Of ComboBoxDropDownClosedEventArgs)
Visual C++
public:
 event EventHandler<ComboBoxDropDownClosedEventArgs^>^ DropDownClosed {
	void add (EventHandler<ComboBoxDropDownClosedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxDropDownClosedEventArgs^>^ value);
}
See Also
ComboBox Class
Autodesk.Revit.UI Namespace